xrunda/esp32Box_displayPic_Arduino/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_SPIRAM_SUPPORT=y

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_LV_COLOR_16_SWAP=y
# 83 == 'S'
CONFIG_LV_FS_POSIX_LETTER=83
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_USE_BMP=y
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_USE_GIF=y
CONFIG_LV_USE_PNG=y
CONFIG_LV_USE_SJPG=y

CONFIG_PARTITION_TABLE_CUSTOM=y

CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# BSP
CONFIG_BSP_LCD_DRAW_BUF_HEIGHT=10

# Audio Codec - Use backward compatible I2C driver
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=y

# Task Watchdog - Increase timeout for JPEG decoding
# JPEG decoding can take a long time, especially for large images
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# WiFi Configuration
#公司
#CONFIG_WIFI_SSID="xrunda-iot"
#CONFIG_WIFI_PASSWORD="88888888"
#二里庄
CONFIG_WIFI_SSID="CU_thEy"
CONFIG_WIFI_PASSWORD="uwzp4ka3"
